In [ ]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

um = pd.read_csv("Data/UrbanMart_Transactions.csv")

In [2]:
um.head(1)
um.tail(2)
um.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   TransactionID     50000 non-null  object
 1   CustomerID        50000 non-null  object
 2   TransactionDate   50000 non-null  object
 3   TransactionValue  50000 non-null  int64
 4   ProductCategory   50000 non-null  object
 5   PaymentMethod     50000 non-null  object
 6   CustomerGender    50000 non-null  object
 7   CustomerAgeGroup  50000 non-null  object
 8   Region            50000 non-null  object
dtypes: int64(1), object(8)
memory usage: 3.4+ MB

In [147]:
um.shape

(50000, 13)

In [3]:
#Checking how many columns are:
um.columns

Index(['TransactionID', 'CustomerID', 'TransactionDate', 'TransactionValue',
       'ProductCategory', 'PaymentMethod', 'CustomerGender',
       'CustomerAgeGroup', 'Region'],
      dtype='object')

In [4]:
#Checking Data Types and change date datatype:
um.dtypes
um['TransactionDate']=pd.to_datetime(um['TransactionDate'])
um['TransactionValue']=pd.to_numeric(um['TransactionValue'])

In [5]:
#Checking null value , duplicate value and replace it :
um.isna().sum() # NO null value

TransactionID       0
CustomerID          0
TransactionDate     0
TransactionValue    0
ProductCategory     0
PaymentMethod       0
CustomerGender      0
CustomerAgeGroup    0
Region              0
dtype: int64

In [6]:
#Duplicate checking:
um.duplicated().sum() # NO Duplicated rows

np.int64(0)

In [7]:
# statistic Describe:
um.describe()

                  TransactionDate  TransactionValue
count                       50000      5.000000e+04
mean   2023-12-31 12:45:12.960000      2.534081e+06
min           2023-01-01 00:00:00      5.006000e+04
25%           2023-07-02 00:00:00      1.304192e+06
50%           2023-12-31 00:00:00      2.537391e+06
75%           2024-07-01 00:00:00      3.768265e+06
max           2024-12-30 00:00:00      4.999929e+06
std                           NaN      1.429538e+06

In [80]:
#Transforming columns:
um['TransactionValue_Lakhs'] = um['TransactionValue']/100000
um['TransactionValue_Lakhs'] = um['TransactionValue_Lakhs'].round(2)
um['TransactionValue_Lakhs']

0         4.68
1        27.14
2        45.39
3        30.58
4        33.05
         ...
49995    32.37
49996    49.67
49997    11.41
49998    35.05
49999    10.89
Name: TransactionValue_Lakhs, Length: 50000, dtype: float64

In [91]:
# Checking  realted data  or different data from  the data set :
um['CustomerAgeGroup'].unique()
um['PaymentMethod'].unique()
um['Region'].unique()
um['ProductCategory'].unique()
um['TransactionDate'].unique()
um['TransactionID'].unique()

array(['TRANS000000', 'TRANS000001', 'TRANS000002', ..., 'TRANS049997',
       'TRANS049998', 'TRANS049999'], shape=(50000,), dtype=object)

In [9]:
# Transform Date column:
# um.drop(columns='Transcation_month',axis=1,inplace=True)
um['T_Month'] = um['TransactionDate'].dt.month
um['T_Month_Name'] = um['TransactionDate'].dt.month_name()
um['T_Year'] = um['TransactionDate'].dt.year

In [10]:
# Removing unwanted spaces:
um['CustomerGender'] = um['CustomerGender'].str.strip()
um['CustomerID'] = um['CustomerID'].str.strip()
um['ProductCategory'] = um['ProductCategory'].str.strip()
um['PaymentMethod'] = um['PaymentMethod'].str.strip()
um['Region'] = um['Region'].str.strip()
um.head()

,TransactionID,CustomerID,TransactionDate,TransactionValue,ProductCategory,PaymentMethod,CustomerGender,CustomerAgeGroup,Region,T_Month,T_Month_Name,T_Year
0,TRANS000000,CUST01574,2023-04-09,467907,Sport,Bank Transfer,Female,>50,Surabaya,4,April,2023
1,TRANS000001,CUST01836,2024-08-05,2713789,Beauty,Credit Card,Female,26-35,Surabaya,8,August,2024
2,TRANS000002,CUST01291,2024-04-07,4539248,Fashion,Bank Transfer,Male,18-25,Bandung,4,April,2024
3,TRANS000003,CUST00245,2024-06-12,3058426,Home,Bank Transfer,Male,36-50,Jakarta,6,June,2024
4,TRANS000004,CUST00163,2023-12-18,3304874,Fashion,Bank Transfer,Female,26-35,Jakarta,12,December,2023

In [142]:
#Renaming column name and lower_case:
um.rename(columns={
  'CustomerGender':'Gender',
  'CustomerAgeGroup' : 'Age_Group',
  'TransactionID' : 'Transaction_ID',
  'CustomerID' : 'Customer_ID',
  'TransactionDate': 'Transaction_Date',
  'ProductCategory' :'Product_Category',
  'TransactionValue' : 'Transaction_Value',
  'PaymentMethod' :'payment_Method'

},inplace=True)
um.columns = um.columns.str.lower()
um.head()

,transaction_id,customer_id,transaction_date,transaction_value,product_category,payment_method,gender,age_group,region,transactionvalue_lakhs,t_month,t_month_name,t_year
0,TRANS000000,CUST01574,2023-04-09,467907,Sport,Bank Transfer,Female,>50,Surabaya,4.68,4,April,2023
1,TRANS000001,CUST01836,2024-08-05,2713789,Beauty,Credit Card,Female,26-35,Surabaya,27.14,8,August,2024
2,TRANS000002,CUST01291,2024-04-07,4539248,Fashion,Bank Transfer,Male,18-25,Bandung,45.39,4,April,2024
3,TRANS000003,CUST00245,2024-06-12,3058426,Home,Bank Transfer,Male,36-50,Jakarta,30.58,6,June,2024
4,TRANS000004,CUST00163,2023-12-18,3304874,Fashion,Bank Transfer,Female,26-35,Jakarta,33.05,12,December,2023

In [ ]:
#Save the cleaned data :
um.to_csv("Urbanmart_cleaned.csv",index= False)